Revit 2027 API
Curve.Length Property
The exact length of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
public:
property double Length {
	double get ();
}
member Length : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the curve is unbound and not periodic.
Remarks
Computes the length of the curve using analytical or numeric integration. There is no performance hit for lines and arcs.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace